ventanilla_unica_Web_servicec_scraping/payload_structure/templates/consultar_pedimento_completo.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:con="http://www.ventanillaunica.gob.mx/pedimentos/ws/oxml/consultarpedimentocompleto"
   xmlns:com="http://www.ventanillaunica.gob.mx/pedimentos/ws/oxml/comunes">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1"
         xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken>
            <wsse:Username>{username}</wsse:Username>
            <wsse:Password
               Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{password}</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <con:consultarPedimentoCompletoPeticion>
         <con:peticion>
            <com:aduana>{aduana}</com:aduana>
            <com:patente>{patente}</com:patente>
            <com:pedimento>{pedimento}</com:pedimento>
         </con:peticion>
      </con:consultarPedimentoCompletoPeticion>
   </soapenv:Body>
</soapenv:Envelope>